# CannotCopyWatchCurveBasedFixture Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..CannotCopyWatchCurveBasedFixture Property
BuiltInFailures..::..FamilyFailures Class See Also
---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCopyWatchCurveBasedFixture { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCopyWatchCurveBasedFixture As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCopyWatchCurveBasedFixture {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace